eisup_2019_docmng_integration/src/InformationRegisters/СостоянияОСОрганизаций/СостоянияОСОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияОСОрганизаций</name>
  <comment>Состояния ОС организаций</comment>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаСостояния</name>
    <comment>Дата состояния</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <comment>Основное средство</comment>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <comment>Организация</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Состояние</name>
    <comment>Состояние</comment>
    <type>
      <types>EnumRef.СостоянияОС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/ПервоначальныеСведенияОСБухгалтерскийУчет/ПервоначальныеСведенияОСБухгалтерскийУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПервоначальныеСведенияОСБухгалтерскийУчет</name>
  <comment>(Регл) Регистр, который показывает изменение инвентарного номера ОС при передаче его из одной организации в другую. Информация записывается только документами ПринятиеКУчету по бух. виду учета и ввод остатков</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособПоступления</name>
    <type>
      <types>EnumRef.СпособыПоступленияАктивов</types>
    </type>
  </resources>
  <resources>
    <name>СпособНачисленияАмортизации</name>
    <type>
      <types>EnumRef.СпособыНачисленияАмортизацииОС</types>
    </type>
  </resources>
  <resources>
    <name>ПервоначальнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПараметрВыработки</name>
    <type>
      <types>CatalogRef.ПараметрыВыработкиОС</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/СостоянияОС/СостоянияОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияОС</name>
  <comment>Состояния ОС</comment>
  <enumValues>
    <name>ПринятоКУчету</name>
    <comment>Принято к учету</comment>
  </enumValues>
  <enumValues>
    <name>ВведеноВЭксплуатацию</name>
    <comment>Введено в эксплуатацию</comment>
  </enumValues>
  <enumValues>
    <name>СнятоСУчета</name>
    <comment>Снято с учета</comment>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/InformationRegisters/СостоянияОСОрганизаций/RecordSetModule.bsl
Процедура ЗаписатьИсторию(Запись)

	ОС = Запись.ОсновноеСредство;
	ОбъектОС = ОС.ПолучитьОбъект();
	Если ОбъектОС = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	ТЧИстория = ОбъектОС.абс_История;
	ПараметрыОтбора = Новый Структура("Код, Наименование, Организация, Состояние, Регистратор, абс_СтатусОС", 
	ОбъектОС.Код, ОбъектОС.Наименование, Запись.Организация, Запись.Состояние, ЭтотОбъект.Отбор.Регистратор.Значение, ОбъектОС.абс_СтатусОС);
	Если ТЧИстория.Количество() > 0 Тогда 
		НайденныеСтроки = ТЧИстория.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	НоваяСтрокаТЧ = ТЧИстория.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, ПараметрыОтбора);
	НоваяСтрокаТЧ.Период = НоваяСтрокаТЧ.Регистратор.Дата;
	НоваяСтрокаТЧ.ИнвентарныйНомер = ПолучитьИнвентарныйНомер(ОС);
	ОбъектОС.ОбменДанными.Загрузка = Истина;
	ОбъектОС.Записать();
	
КонецПроцедуры

Функция ПолучитьИнвентарныйНомер(ОсновноеСредство)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПервоначальныеСведенияОСБухгалтерскийУчетСрезПоследних.ИнвентарныйНомер
		|ИЗ
		|	РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(, ОсновноеСредство = &ОсновноеСредство) КАК ПервоначальныеСведенияОСБухгалтерскийУчетСрезПоследних";

	Запрос.УстановитьПараметр("ОсновноеСредство", ОсновноеСредство);
	
	Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ИнвентарныйНомер;
	
КонецФункции 

Процедура ПриЗаписи(Отказ, Замещение)
	
	Для каждого Запись Из ЭтотОбъект Цикл
		Если Запись.Состояние = Перечисления.СостоянияОС.ПринятоКУчету Тогда 
			Продолжить;
		КонецЕсли;	
		ЗаписатьИсторию(Запись);
	КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЭтотОбъект.Количество() = 0 Тогда 
		Регистратор = ЭтотОбъект.Отбор.Регистратор.Значение; 
		ТипЗнчРегистратора = ТипЗнч(Регистратор);
		Если ТипЗнчРегистратора = Тип("ДокументСсылка.СписаниеОС") Или 
			ТипЗнчРегистратора = Тип("ДокументСсылка.ВводНачальныхОстатковОС") Тогда 
			ОчиститьИсториюВКарточкахОС(Регистратор);
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОчиститьИсториюВКарточкахОС(Регистратор)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОсновныеСредстваабс_История.Ссылка
		|ИЗ
		|	Справочник.ОсновныеСредства.абс_История КАК ОсновныеСредстваабс_История
		|ГДЕ
		|	ОсновныеСредстваабс_История.Регистратор = &Регистратор";

	Запрос.УстановитьПараметр("Регистратор", Регистратор);

	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();

	Пока Выборка.Следующий() Цикл
		
		ОС = Выборка.Ссылка.ПолучитьОбъект();
		ИсторияТЧ = ОС.абс_История;
		ПараметрыОтбора = Новый Структура("Регистратор", Регистратор);
		СтрокиДляУдаления = ИсторияТЧ.НайтиСтроки(ПараметрыОтбора);
		
		Для каждого УдаляемаяСтрока Из СтрокиДляУдаления Цикл
			
			ИсторияТЧ.Удалить(УдаляемаяСтрока);	
			
		КонецЦикла;
		
		ОС.ОбменДанными.Загрузка = Истина;
		ОС.Записать();
		
	КонецЦикла;
	                                     
КонецПроцедуры
